Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/D09B.tmx
Source language: en_us
Languages: zh_cn

source: What is the Second Coming of Jesus Christ?
zh_cn: 何为耶稣第二次到来？

source: The second coming of Jesus Christ is the hope of believers that God is in control of all things, and is faithful to the promises and prophecies in His Word.
zh_cn: 耶稣第二次到来是基督徒们的夙愿，他们相信耶稣基督掌控着世界万物，而且恪守他的承诺。

source: In His first coming, Jesus Christ came to earth as a baby in a manger in Bethlehem, just as prophesied.
zh_cn: 他的第一次降临，正如传教所讲的那样，耶稣基督作为一个婴儿降生在伯利恒的一个马槽中。

source: Jesus fulfilled many of the prophecies of the Messiah during His birth, life, ministry, death, and resurrection.
zh_cn: 耶稣在他的出生，成长，事奉，死亡，复活中使许多关于救世主的预言成为现实。

source: However, there are some prophecies regarding the Messiah that Jesus has not yet fulfilled.
zh_cn: 然而有些救世主的预言耶稣却没有使其成为现实。

source: The second coming of Christ will be the return of Christ to fulfill these remaining prophecies.
zh_cn: 基督的第二次降临将会是他为实现这些预言的归来。

source: In His first coming, Jesus was the suffering Servant.
zh_cn: 在第一次降临中，耶稣是作为一个受苦受难的仆人出现的。

source: In His second coming, Jesus will be the conquering King.
zh_cn: 而在第二次降临中耶稣将会是一位所向无敌的君王。

source: In His first coming, Jesus arrived in the most humble of circumstances.
zh_cn: 第一次降临，耶稣出生在一个卑微的环境中。

source: In His second coming, Jesus will arrive with the armies of heaven at His side.
zh_cn: 在他的第二次降临中，天军将伴随在他身旁。

source: The Old Testament prophets did not make clearly this distinction between the two comings. This can be seen in Isaiah 7:14, 9:6-7and Zechariah 14:4.
zh_cn: 在以赛亚书七章十四节和九章第六，七节以及撒加利亚书十四章四节中，旧约书中的先知们并没有区别清楚这两次降临。

source: As a result of the prophecies seeming to speak of two individuals, many Jewish scholars believed there would be both a suffering Messiah and a conquering Messiah.
zh_cn: 由于这些预言好像是在说两个救世主，许多犹太学者相信有一个受苦受难的救世主还有一个所向无敌的救世主。

source: What they failed to understand is that there is only one Messiah and He would fulfill both roles.
zh_cn: 他们不理解只有一个救世主，他充当两个角色。

source: Jesus fulfilled the role of the suffering servant (Isaiah chapter 53) in His first coming.
zh_cn: 在第一次降临中，耶稣是一个受苦受难的仆人（以赛亚书53章）。

source: Jesus will fulfill the role of Israel's deliverer and King in His second coming.
zh_cn: 在第二次降临中，耶稣将是以色列的国王和拯救者。

source: Zechariah 12:10 and Revelation 1:7, describing the second coming, look back to Jesus being pierced.
zh_cn: 撒加利亚书十二章十节和启示录一章七节描述了耶稣的第二次降临并回顾了耶稣在十字架上被长矛刺穿。

source: Israel, and the whole world, will mourn for not having accepted the Messiah the first time He came.
zh_cn: 以色列以及整个世界将会因没有接受耶稣的第一次降临而哀鸣。

source: After Jesus ascended into heaven, the angels declared to the apostles, "'Men of Galilee,' they said, 'why do you stand here looking into the sky?
zh_cn: 耶稣升天之后，天使向信徒郑重地说：“加利利的人们，你们为什么只站在那里望着空中？

source: This same Jesus, who has been taken from you into heaven, will come back in the same way you have seen him go into heaven'" (Acts 1:11).
zh_cn: 耶稣从你们中升天，他必将与你们见到他升天一样降临”（使徒行传一章十一节）。

source: Zechariah 14:4 identifies the location of the second coming as the Mount of Olives.
zh_cn: 在撒加利亚书十四章四节中指出第二次降临的地点将是橄榄山。

source: Matthew 24:30 declares, "At that time the sign of the Son of Man will appear in the sky, and all the nations of the earth will mourn. They will see the Son of Man coming on the clouds of the sky, with power and great glory."
zh_cn: 马太福音二十四章三十节写道：“到那个时候，人子将会出现在空中，地上万国将要哀鸣，他们会看到人子带着无比的权柄和荣耀出现在云端。”

source: Titus 2:13 describes the second coming as a "glorious appearing."
zh_cn: 提多书二章十三节把第二次降临描述为“荣耀的显现。”

source: The second coming is spoken of in greatest detail in Revelation 19:11-16, "I saw heaven standing open and there before me was a white horse, whose rider is called Faithful and True.
zh_cn: 在启示录十九章十一到十六节中详细描绘了耶稣的第二次降临，“我看到天国之门大开，在我的面前是一匹白马，马背上的骑士叫做信仰与真理。

source: With justice he judges and makes war.
zh_cn: 他公正审判，为正义征战。

source: His eyes are like blazing fire, and on his head are many crowns.
zh_cn: 他双目如烈火，他头上戴着众王之冠。

source: He has a name written on him that no one knows but he himself.
zh_cn: 他的名字写在身上只有他自己知道。

source: He is dressed in a robe dipped in blood, and his name is the Word of God.
zh_cn: 他身上的袍子沾满鲜血，他的名字就是世界之神。

source: The armies of heaven were following him, riding on white horses and dressed in fine linen, white and clean.
zh_cn: 天军骑着白马穿着白色精美的亚麻布衣服跟随着他。

source: Out of his mouth comes a sharp sword with which to strike down the nations. 'He will rule them with an iron scepter.'
zh_cn: 他从口中吐出一柄利剑来击打万国。他用铁杖统治他们。

source: He treads the winepress of the fury of the wrath of God Almighty.
zh_cn: 他踏着万能上帝的怒火。

source: On his robe and on his thigh he has this name written: KING OF KINGS AND LORD OF LORDS."
zh_cn: 在他的袍子和腿上写着他的名字：万王之王，万主之主。”
